---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.NodeConnectionStatus
source: html/ace0a345-e62e-83a4-0501-13e527805208.htm
---
# Autodesk.Revit.DB.ParameterTypeId.NodeConnectionStatus Property

"Connection Status"

## Syntax (C#)
```csharp
public static ForgeTypeId NodeConnectionStatus { get; }
```